CFDEMcoupling-MATHEGRAM/tutorials/cfdemSolverBuoyantPimple/pebbleBed_full/CFD/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     cfdemSolverBuoyantPimple;
startTime       0;
endTime         20000; 
deltaT          1;

writeControl    runTime;
writeInterval   100;

writeFormat     ascii;
writePrecision  6;
writeCompression off;

timeFormat      general;
timePrecision   6;

libs
(
   "libderivedFvPatchFieldsCFDEM.so"
);

// ************************************************************************* //
