CFDEMcoupling-MATHEGRAM/tutorials/cfdemSolverBuoyantPimple/pebbleBed_full/CFD/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0     0     0)
    (0.42  0     0)
    (0.42  0.42  0) 
    (0     0.42  0)   

    (0     0     0.42)
    (0.42  0     0.42)
    (0.42  0.42  0.42) 
    (0     0.42  0.42) 
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (6 4 4) simpleGrading (1 1 1)
);

edges
(
);

boundary         
(
    hotWall
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }

    coolWall
    {
        type wall;
        faces
        (
            (1 2 6 5)
        );
    }

    insulation
    {
        type wall;
        faces
        (
            (2 7 3 6)
            (0 3 2 1)
            (4 5 6 7)
            (0 1 5 4)
        );
    }


);

mergePatchPairs
(
);

// ************************************************************************* //
