CFDEMcoupling-MATHEGRAM/tutorials/cfdemSolverBuoyantPimple/pebbleBed_full/CFD/constant/couplingProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/


FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          couplingProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//===========================================================================//
// sub-models & settings

solveFlow           true;
modelType           "B";
couplingInterval    1;

voidFractionModel   divided;
locateModel         engine;
meshMotionModel     noMeshMotion;
IOModel             basicIO;
probeModel          off;
dataExchangeModel   twoWayMPI;
averagingModel      dense;
clockModel          off;
smoothingModel      off;

forceModels
(
    KochHillDrag
    //LaEuScalarTemp
    LaEuScalarRadiation
    Archimedes
);

momCoupleModels
(
    implicitCouple
);

turbulenceModelType turbulenceProperties;

//===========================================================================//
// sub-model properties

LaEuScalarTempProps
{
    tempFieldName "T";
    partTempName "Temp";
    partHeatFluxName "convectiveHeatFlux";
    lambda 0.0; // fluid conductivity (cp*mu/Pr)
    Cp 1007;
    compressible true;
    NuCorrelation Gunn;
    voidfractionFieldName "voidfraction";
    velFieldName "U";
}

LaEuScalarRadiationProps
{
    partTempName "Temp";
    partHeatFluxName "radiativeHeatFlux";
    epsilon 0.8;
    Qabs 0.8; 
    Qsca 0.2; 
    useBrewsterCorrection true; 
    verbose true;
    interpolation true;
}

implicitCoupleProps
{
    velFieldName "U";
    granVelFieldName "Us";
    voidfractionFieldName "voidfraction";
    //KslLimit 0;  // source switched off!!!
}
KochHillDragProps
{
    velFieldName "U";
    voidfractionFieldName "voidfraction";
}
ArchimedesProps
{
    gravityFieldName "g";
}

twoWayMPIProps
{
    maxNumberOfParticles 10000;
    liggghtsPath "../DEM/in.liggghts_run";
}

engineProps
{
    treeSearch true;
}

dividedProps
{
    alphaMin 0.4;
    voidfractionFieldName "voidfraction";
}

// ************************************************************************* //
