CFDEMcoupling-MATHEGRAM/tutorials/cfdemSolverBuoyantPimple/pebbleBed_full/CFD/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(p|p_rgh)"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0.1;
    }

    "(p|p_rgh)Final"
    {
        $p;
        relTol          0;
    }

    "rho.*"
    {
        $p;
        tolerance       1e-05;
        relTol          0;
    }

    "(U|k|h|epsilon|omega|R|nuTilda)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-05;
        relTol          0.1;
    }

    "(U|k|h|epsilon|omega|R|nuTilda)Final"
    {
        $U;
        relTol          0;
    }

    "(voidfraction|Us|Ksl|dSmoothing|UsNext|voidfractionNext|sSmoothField|vSmoothField)"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-05;
        relTol          0;
    }

    "(T|C)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0;
    }

    G
    {
        $p;
        tolerance       1e-08;
        relTol          0.1;
    }
    GFinal
    {
        $p;
        tolerance       1e-08;
        relTol          0.1;
    }
}

PIMPLE
{
    nOuterCorrectors 1;
}
relaxationFactors
{
    fields
    {
	    p	1.0;
    }
    equations
    {
        "U.*"           1.0;
        "k.*"           1.;
        "epsilon.*"     1.;
        "G.*"           0.3; 
    }
}

PISO
{
    nCorrectors     4;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}


// ************************************************************************* //
